# LayoutRuleFixedNumber Class

---
This class indicate the layout rule of a Beam System is Fixed-Number.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleFixedNumber
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LayoutRuleFixedNumber : LayoutRule

    Public Class LayoutRuleFixedNumber
    	Inherits LayoutRule

    public ref class LayoutRuleFixedNumber : public LayoutRule

    type LayoutRuleFixedNumber =
        class
            inherit LayoutRule
        end
The LayoutRuleFixedNumber type exposes the following members.
| Name| Description
---|---|---
| LayoutRuleFixedNumber| Constructor of LayoutRuleFixedNumber.
Top
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| NumberOfLines| Get or set the number of the beams in a beam system.
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
To use this type of LayoutRule, only the number of the beams must be set.
#### Reference
Autodesk.Revit.DB Namespace